---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRailingHeightShiftVal
source: html/2fd54bc7-83ec-bc69-4e97-74482d420f54.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRailingHeightShiftVal Property

"Landing Height Adjustment"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRailingHeightShiftVal { get; }
```